In [472]:
import pandas as pd

#load data
data = pd.read_csv('/home/raj/Desktop/Github_Project/House_Price_Predictor/data/bengaluru_house_prices.csv') 
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [473]:
data = data.drop(['area_type', 'availability','society'], axis=1) #delete collumns

In [474]:
data.isnull().sum() #check null values

location        1
size           16
total_sqft      0
bath           73
balcony       609
price           0
dtype: int64

In [475]:
data = data.dropna(subset=['location','size'])#delete null values from specific columns

In [476]:
data = data.reset_index(drop=True)# reset index number

In [477]:
data =data.rename(columns={'size' : 'bhk'}) # renamed column size

In [478]:
data.head()#check column

                   location        bhk total_sqft  bath  balcony   price
0  Electronic City Phase II      2 BHK       1056   2.0      1.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0      3.0  120.00
2               Uttarahalli      3 BHK       1440   2.0      3.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0      1.0   95.00
4                  Kothanur      2 BHK       1200   2.0      1.0   51.00

In [479]:
data['bhk'] = data['bhk'].str.split() #split the bhk columns value

In [480]:
data.head()# check column

                   location           bhk total_sqft  bath  balcony   price
0  Electronic City Phase II      [2, BHK]       1056   2.0      1.0   39.07
1          Chikka Tirupathi  [4, Bedroom]       2600   5.0      3.0  120.00
2               Uttarahalli      [3, BHK]       1440   2.0      3.0   62.00
3        Lingadheeranahalli      [3, BHK]       1521   3.0      1.0   95.00
4                  Kothanur      [2, BHK]       1200   2.0      1.0   51.00

In [481]:
for i in range(len(data['bhk'])):
    data['bhk'] = data['bhk'][i][0]  #removed string value

In [482]:
data.head()#check removal

                   location bhk total_sqft  bath  balcony   price
0  Electronic City Phase II   2       1056   2.0      1.0   39.07
1          Chikka Tirupathi   2       2600   5.0      3.0  120.00
2               Uttarahalli   2       1440   2.0      3.0   62.00
3        Lingadheeranahalli   2       1521   3.0      1.0   95.00
4                  Kothanur   2       1200   2.0      1.0   51.00

In [483]:
data['bhk'] = data['bhk'].astype(int) #convert type str to int

In [484]:
data.info()#chek data types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13303 entries, 0 to 13302
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13303 non-null  object
 1   bhk         13303 non-null  int64
 2   total_sqft  13303 non-null  object
 3   bath        13246 non-null  float64
 4   balcony     12710 non-null  float64
 5   price       13303 non-null  float64
dtypes: float64(3), int64(1), object(2)
memory usage: 623.7+ KB

In [485]:
data.head()#check data

                   location  bhk total_sqft  bath  balcony   price
0  Electronic City Phase II    2       1056   2.0      1.0   39.07
1          Chikka Tirupathi    2       2600   5.0      3.0  120.00
2               Uttarahalli    2       1440   2.0      3.0   62.00
3        Lingadheeranahalli    2       1521   3.0      1.0   95.00
4                  Kothanur    2       1200   2.0      1.0   51.00

In [486]:
data['location'] = data['location'].str.strip()#remove spaces from start and end in location column

In [487]:
loc_group = data.groupby('location')['location'].agg('count').sort_values(ascending=False)#group the value and arrange in descending order

In [488]:
rare_location = loc_group[loc_group <= 10]#save the rare location

In [489]:
data['location'] = data['location'].apply(lambda x: 'other' if x in rare_location else x) #replace rare locations to other

In [490]:
len(data['location'].unique())

242

In [491]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13303 entries, 0 to 13302
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13303 non-null  object
 1   bhk         13303 non-null  int64
 2   total_sqft  13303 non-null  object
 3   bath        13246 non-null  float64
 4   balcony     12710 non-null  float64
 5   price       13303 non-null  float64
dtypes: float64(3), int64(1), object(2)
memory usage: 623.7+ KB

In [492]:
data.head()

                   location  bhk total_sqft  bath  balcony   price
0  Electronic City Phase II    2       1056   2.0      1.0   39.07
1          Chikka Tirupathi    2       2600   5.0      3.0  120.00
2               Uttarahalli    2       1440   2.0      3.0   62.00
3        Lingadheeranahalli    2       1521   3.0      1.0   95.00
4                  Kothanur    2       1200   2.0      1.0   51.00

In [493]:
def nois_clean(x):
    try:
        float(x)
        return True
    except:
        if '-' in x :
            return True
        else:
            return False

In [494]:
data = data[data['total_sqft'].apply(nois_clean)]

In [495]:
data =data.reset_index(drop=True)

In [496]:
def range_to_avg(x):
    try:
        if '-' in x :
            x = x.split('-')
            peace_1 = float(x[0])
            peace_2 = float(x[-1])
            avg = (peace_1 + peace_2)/2
            return avg
        else:
            float(x)
            return x
    except:
        print("check the input")

In [497]:
data['total_sqft'] = data['total_sqft'].apply(range_to_avg)

In [498]:
data['total_sqft'] = data['total_sqft'].astype(float)

In [499]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13257 entries, 0 to 13256
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13257 non-null  object
 1   bhk         13257 non-null  int64
 2   total_sqft  13257 non-null  float64
 3   bath        13200 non-null  float64
 4   balcony     12668 non-null  float64
 5   price       13257 non-null  float64
dtypes: float64(4), int64(1), object(1)
memory usage: 621.6+ KB

In [500]:
data = data[ (data['total_sqft'] / data['bhk']) >=300 ]

<class 'pandas.core.frame.DataFrame'>
Index: 12974 entries, 0 to 13255
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    12974 non-null  object
 1   bhk         12974 non-null  int64
 2   total_sqft  12974 non-null  float64
 3   bath        12921 non-null  float64
 4   balcony     12391 non-null  float64
 5   price       12974 non-null  float64
dtypes: float64(4), int64(1), object(1)
memory usage: 709.5+ KB